package com.wt.cmd;

public enum MsgTypeEnum
{
	testRtt(-1001,"RTT"),
	TEST(-1000,"test"),
	HEARTBEAT(-999,"心跳包"),
	HEARTBEAT_RESPONSECLIENT(-998,"心跳包"),
	SHUTDOWN(-997,"SHUTDOWN"),

	UTIL_SERVER_TIME(100,""),// 服务器时间
	UTIL_SERVER_LIST(101,"服务器列表"),
	UTIL_CHECK_FILE(102,""), // 检查文件是否最新
	UTIL_DOWNLOAD_RES(103,""), // 下载文件
	UTIL_SERVER_PUSH_服务器推送(104,""),// 服务器主动推送
	UTIL_服务器开关(105,""),
	UTIL_获取推广二维码(106,""),
	UTIL_GET_NEW_MD5(107,""),
	UTIL_GET_NEW_FILE_URL(108,"UTIL_GET_NEW_FILE_URL"),
	
	EMAIL_NEW(109,"发送邮件"),      	 //客户端向服务器请求发送一封全服邮件（测试用）
	EMAIL_READALL (113,"一键已读"),   //一键已读
	EMAIL_DELETE ( 114,"删除邮件"),   	 //删除邮件
	EMAIL_DELETEREAD(115,"删除所有已读邮件") ,//删除所有已读邮件
	
	/** 公共错误 **/
	ERROR_SESSIONERR(151,""),// 权限错误，未登陆等
	ERROR_PARAMETER(152,""),
 	
	    /**定时任务***/
	 TIMESTASK(180,"定时任务"),//定时任务消息请求
	
	 RealNameAuthentication(190,"身份证验证"),
	AntiAddictionTips(191,"防沉迷推送"),
	
	
	/**** 用户 ****/
	USER_LOGIN(200,"登录"), // 登录
	USER_REGISTER(201,"注册"), // 注册
	USER_SERVER_INFO(202,""),
	USER_使用激活码(203,"兑换礼物"),// 兑换礼物
	
	USER_REGISTER_GETCODE(205,"注册,获取验证码"), // 注册,获取验证码
	USER_ADMIN_LOGIN(206,"管理员权限登录"),// 管理员权限登录任何账户，无需密码
	USER_REGISTER_TESTACCOUNT(207,"注册测试帐号"),// 注册测试帐号
	USER_FASTLOGIN(209,"FASTLOGIN"),
	USER_注册游客账号(210,"注册游客账号"),
	USER_游客快速登录(211,"游客快速登录"),
	USER_反馈(212,"反馈"),
	USER_令牌登录(213,"令牌登录"),
	USER_鉴权失败(214,"鉴权失败"),
	USER_DEBUGLOGIN(215,"DEBUGLOGIN"),
	USER_WX_LOGIN(220,"微信登录"),// 微信登录
	USER_VALIDATION_TOKEN(221,"验证token"),
	USER_TOKEN_LOGIN(222,"token登陆"),
	USER_上传自定义头像(223,"上传自定义头像"),
	/**********通杀场******/
	KillRoom_同步庄家金币(243,"同步庄家金币"),
	KillRoom_通杀场同步上桌玩家金币(244,"切换状态到通杀场开奖状态"),
	KillRoom_获取所有红包(245,"获取所有红包"),
	KillRoom_红包公告(246,"红包公告"),
	KillRoom_其他玩家下庄(247,"通杀场其他玩家下庄"),
	KillRoom_其他玩家上庄(248,"通杀场其他玩家上庄"),
	KillRoom_获取奖池(249,"获取奖池"),
	KillRoom_休息时间(250,"切换状态到通杀场休息状态"),
	KillRoom_通杀场下注时间(251,"切换状态到通杀场下注状态"),
	KillRoom_通杀场开奖状态(252,"切换状态到通杀场开奖状态"),
	
	KillRoom_进入通杀场(253,"进入通杀场"),
	KillRoom_离开通杀场(254,"离开通杀场"),
	KillRoom_通杀场下注(255,"通杀场下注"),
	KillRoom_通杀场上庄(256,"通杀场上庄"),
	KillRoom_通杀场下庄(257,"通杀场下庄"),
	
	KillRoom_其他玩家下注(258,"通杀场其他玩家下注"),
	KillRoom_其他玩家坐下(259,"其他玩家坐下"),
	KillRoom_选座坐下(260,"选座坐下"),
	KillRoom_从座位站起(261,"从座位站起"),
	KillRoom_其他玩家站起(262,"其他玩家站起"),
	KillRoom_庄家列表(263,"庄家列表"),
	KillRoom_更换庄家(264,"更换庄家"),
	KillRoom_自己下庄(265,"自己下庄"),
	KillRoom_发红包(266,"通杀场发红包"),
	KillRoom_大赢家(267,"通杀大赢家"),//超过100万
	KillRoom_抢红包(268,"抢红包"),
	KillRoom_抢红包结束(269,"通杀场发红包结束"),
	
	classic_进入新手场(270,"进入新手场"),
	classic_开始发牌(271,"开始发牌"),
	classic_其他玩家进入房间(272,"其他玩家进入房间"),
	classic_玩家行动(273,"玩家动作"),
	classic_玩家弃牌(274,"玩家弃牌"),
	classic_有玩家弃牌(275,"有玩家弃牌"),
	classic_玩家看牌(276,"玩家看牌"),
	classic_有玩家看牌(277,"有玩家看牌"),
	classic_玩家跟注(278,"玩家跟注"),
	classic_有玩家跟注(279,"有玩家跟注"),
	classic_玩家加注(280,"玩家加注"),//Raise bet
	classic_有玩家加注(281,"有玩家加注"),
	classic_玩家准备(282,"经典场玩家准备"),
	classic_其他玩家准备(283,"经典场其他玩家准备"),
	classic_玩家胜利(284,"经典场玩家胜利"),
	classic_玩家离开(285,"经典场玩家离开"),
	classic_其他玩家离开(286,"经典场其他玩家离开"),
	classic_玩家比牌(287,"玩家比牌"),
	classic_其他玩家比牌(288,"其他玩家比牌"),
	classic_玩家全压(289,"经典场全压"),
	classic_其他玩家全压(290,"经典场其他玩家全压"),
	classic_等待比赛开始(291,"经典场等待开始"),
	classic_换桌(292,"经典场换桌"),
	classic_断线重连(293,"经典场断线重连"),
	classic_大赢家(294,"经典场大赢家"),
	
	
	
	manypepol_发牌(296,"万人场发牌"),
	manypepol_有玩家上桌(297,"万人场有玩家上桌"),//有可能是自己
	manypepol_申请上桌(298,"万人场申请上桌"),
	manypepol_玩家进入(299,"玩家进入万人场"),
	manypepol_玩家行动(300,"万人场玩家行动"),
	manypepol_有玩家弃牌(301,"万人场有玩家弃牌"),
	manypepol_玩家看牌(302,"万人场玩家弃牌"),
	manypepol_有玩家看牌(303,"万人场有玩家看牌"),
	manypepol_玩家跟注(304,"万人场玩家跟注"),
	manypepol_其他玩家跟注(305,"万人场其他玩家跟注"),
	manypepol_玩家加注(306,"万人场玩家加注"),
	manypepol_其他玩家加注(307,"万人场其他玩家加注"),
	manypepol_闲家下注(308,"万人场闲家下注"),//自己下注
	manypepol_有闲家下注(309,"万人有场闲家下注"),//别人下注
	manypepol_上桌列表(310,"万人上桌列表"),
	manypepol_其他玩家比牌(311,"万人场其他玩家比牌"),
	manypepol_玩家比牌(312,"万人场玩家比牌"),
	manypepol_玩家弃牌(313,"万人场玩家弃牌"),
	manypepol_玩家全压(314,"万人场玩家全压"),
	manypepol_申请下桌(316,"万人场申请下桌"),
	manypepol_玩家下桌(317,"万人场玩家下桌"),
	manypepol_玩家离开(318,"万人场玩家离开"),
	manypepol_其他玩家全压(319,"万人场玩家全压"),
	manypepol_玩家胜利(320,"万人场玩家胜利"),
	manypepol_开始下注(321,"万人场开始下注"),
	manypepol_等待比赛开始(322,"万人场等待开始"),
	manypepol_断线重连(323,"万人场断线重连"),
	manypepol_获取奖池(324,"万人场奖池"),
	manypepol_其他玩家上庄(325,"万人场其他玩家上庄"),
	manypepol_其他玩家下庄(326,"万人场其他玩家下庄"),
	manypepol_大赢家(327,"万人场大赢家"),

	GAME_货币变化(331,"货币变化"),
	GAME_打开签到(332,"打开签到"),
	GAME_点击签到(333,"点击签到"),
	
	GAME_客户端要求断线重连(334,"客户端要求断线重连"),
	GAME_游戏服断线重连验证(335,"游戏服断线重连验证"),
	
	GGL_单次购买(336,"购买1张刮刮乐"),
	GGL_自定义购买(337,"自定义购买任意张"),
	GGL_兑奖(338,"兑奖"),
	/******************** 游戏设置 *****************************/
 
 	
	/****************** 聊天功能 *******************/
	CHAT_玩家喊话(501,"玩家喊话"),
	CHAT_玩家私聊(502,"玩家私聊"),
	CHAT_表情聊天(503,"表情聊天"),
	CHAT_文字聊天(504,"文字聊天"), 
	CHAT_语音聊天(505,"语音聊天"),
	CHAT_收费表情(506,"收费表情"),      //
	PUSH_收费表情(507,"其他玩家发送收费表情"),
	
	CHAT_公屏频道(509,"公屏频道"),
	CHAT_同盟频道(510,"同盟频道"),
	CHAT_私聊频道(511,"私聊频道"),
	PUSHCHAT_系统频道(512,"系统频道"),
	PUSHCHAT_外交频道(513,"外交频道"),
	PUSHCHAT_日志频道(514,"日志频道"),
	AskTemporaryChat_临时聊天(515,"临时聊天"),
	
	Chat_快捷回复(516,"快捷回复"),
	Chat_小窗聊天(517,"小窗聊天"),
	Horn_喇叭消息(518,"喇叭聊天"),
	
	
	ADDFRIENDS(520,"添加好友"),//添加好友
	ASKFRIENDS(521,"请求好友列表"),//请求好友列表
	ASK_推送添加好友(522,"推送添加好友"),//请求添加好友
	Look_查找好友(523,"查找好友"),//查找好友
	Agree_同意添加好友(524,"同意添加好友"),//同意添加好友
	Info_消息通知(525,"消息通知"),//消息通知
	Info_消息已读(526,"消息已读"),//消息已读
	Add_消息已读(527,"添加消息已读"),//添加消息已读
	Delete_删除消息(528,"删除消息"),//删除消息
	Delete_删除好友(529,"删除好友"),//删除好友
	
	ChatInfo_好友聊天消息(530,"好友聊天消息"),
	ChatInfo_好友聊天状态(531,"好友聊天状态"),
	ChatInfo_好友聊天(532,"好友聊天"),
	Push_好友玩家状态(533,"好友玩家是否离线"),
	
	
	Lottery_下注(540,"彩票下注"),
	Lottery_彩票结果(541,"彩票结果"),
	Lottery_自动下注(542,"自动下注"),
	Lottery_下注时间(543,"下注时间"),
	Lottery_开奖时间(544,"开奖时间"),
	Lottery_同步时间(545,"同步时间"),
	Lottery_金钱改变(546,"金钱改变"),
	Lottery_中奖提示(547,"中奖提示"),
	
	
	EnterFruitMechine(560,"进入水果机"),//进入水果机
	LeaveFruitMechine(561,"离开水果机"),//离开水果机
	FruitMechine(562,"水果机下注"),//水果机下注
	FruitUpBanker(563,"水果机上庄"),//水果机上庄
	FruitDownBanker(564,"水果机下庄"),//水果机下庄
	FruitMechine_开始下注(565,"水果机开始下注"),
	Push_FruitMechine_结算(566,"水果机结算"),
	Fruit_requestBankerList(567,"水果机庄家列表请求"),
	Fruit_bankerListChange(568,"改变庄家"),
	Fruit_bankerWining(569,"改变庄家"),
	Fruit_ContinueXiaZhu(570,"请求连续下注"),
	Fruit_CancelContinueXiaZhu(571,"取消连续下注"),
	Fruit_JiangPool(572,"推送奖池信息"),
	Fruit_断线重连(573,"水果机断线重连"),
	Fruit_下注(574,"有玩家下注"),
	Fruit_大赢家(575,"水果机大赢家"),
	
	Push_TaskInfo(580,"玩家上线时推送玩家任务信息"),
	Push_TaskEveryTimeComplete(581,"玩家每次完成任务时推送"),
	ReceiveReward(582,"领取奖励请求"),
	Push_FreeChouJiang(583,"推送当前玩家是否已经免费抽过奖"),
	ChouJiangResult(584,"抽奖结果"),
	Push_onLineRewardInfo(585,"推送在线奖励信息"),
	RequestLingQuOnLineReward(586,"请求领取在线奖励"),
	/****************** pay&bind **********************/
	PAY_支付宝支付下单(600,""),
	PAY_获取支付结果(601,""),
	PAY_微信支付下单(602,""),
	PAY_提现(603,""),
	PAY_收益清单(604,""),
	PAY_提现清单(605,""),
	BIND_GETINFO(606,""),
	BIND_GETBIND_LV1(607,""),
	PAY_获取苹果支付结果(608,""),
	PAY_支付宝网页支付下单(609,"支付宝网页支付下单"),
	PAY_微信网页支付下单(610,"微信网页支付下单"),
	PAY_支付回调消息(611,""),
	PAY_TestPay(612,"测试支付"),
	PAY_BUYGOLD(613,"购买金币"),
	PAY_BUYITEM(614,"购买道具"),
	/********************* 服务器推送消息 ***********************/
	NOTICE_服务器计时关机(700,""),
	NOTICE_服务器公告(701,""),
	NOTICE_玩家兑换物品(702,""),
	NOTICE_玩家收获(703,""),
	NOTICE_玩家喊话(704,""),
	NOTICE_服务器准备重启(705,""),
	/********************* 商城信息 ***********************/
	MALL_商城信息(720,""),
	MALL_购买商品(721,""),

	/********************* 推送给指定玩家 ***********************/
	PUSHUSER_货币变化(800,"货币变化"),
	PUSHUSER_文字聊天(801,"文字聊天"),
	PUSHUSER_表情聊天(802,"表情聊天"),
	
	PUSHUSER_等级变化(803,"等级变化"),
	
	PUSHUSER_金币变化(804,"金币变化"),
	
	PUSHTREASURE_皇家礼包(880,"皇家礼包"),

	PUSHUSER_玩家私聊(899,"玩家私聊"),
	
	PushFriendsOnLine_好友是否在线(910,"好友是否在线"),
	
	GAME_GETPLAYERNICKNAMES(1042,"获取一些玩家的昵称"),
	
	PUSHUSER_VIP(1043,"vip等级"),
	
	PUSHUSER_另一个设备登录(1044,"另一个设备登录"),
	
	/**************************背包数据传输1250*********************************************/
	 GAME_PLAYERALLBAGINFO (1250," 玩家背包中所有的信息"),
	 GAME_ADDNEWPBAGROP(1252,"玩家添加新的道具"),
	 GAME_BAGRECYCLINGPROP(1253,"回收道具"),
	
	 SafeBox_存入银行(1300,"存入银行"),
	 SafeBox_游戏币转账(1301,"游戏币转账"),
	 SafeBox_游戏币转账确认(1302,"游戏币转账确认"),
	 SafeBox_取出银行(1303,"取出银行"),
	 SafeBox_银行记录(1304,"银行记录"),
	 SafeBox_某人转账给玩家(1305,"某人转账给玩家"),
	 Player_进入游戏主界面(1306,"进入游戏主界面"),
	 
	 MoneyTree_推送产出(1400,"推送产出"),
	 MoneyTree_领取(1401,"MoneyTree_领取"),
	 MoneyTree_同步(1402,"同步"),
	 MoneyTree_升级(1403,"摇钱树升级"),
	 
	 Sign_签到数据(1500,"签到数据"),
	 Sign_签到(1501,"签到"),
	 Sign_更新签到(1502,"更新签到"),
	 
	 /******************************服务器间通信***********************************/
	 COMMUNICATION_AUTH_实名验证(2000,"通知账号服有玩家实名认证"),
	 COMMUNICATION_AUTH_玩家登出游戏服(2001,"通知账号服有玩家实名认证"),
	 
	 /**************设置*****************/
	 UPDATENICKNAME(2100,"修改昵称"),
	UPDATESIGN(2101,"修改签名"),
	UPDATEGENDER(2102,"修改性别"),
	
	RANKING(2105,"排行榜"),
	RANKINGREWARD(2106,"赢金榜奖励"),  //rankingreward
	
	LUCKY(2110,"抽奖"),//幸运转盘
	BINDPHONE_GETCODE(2120,"绑定手机获取验证码"),
	BINDPHONE(2121,"绑定手机号"),
	MODIFYPWD(2122,"修改密码"),
	SET_更新玩家手机号(2123,"更新手机号"),//通知帐号服更新玩家手机号
	SET_完善账号(2124,"完善账号"),
	SET_切换账号(2125,"切换账号"),
	SET_找回密码(2126,"找回密码"),
	SET_找回密码获取验证码(2127,"找回密码获取验证码"),
	
	MAIL_READ(2200,"读取邮件"),
	MAIL_GETALL(2201,"请求所有邮件"),
	MAIL_GETATTACH(2202,"领取邮件附件"),
	MAIL_DELETE(2203,"删除邮件"),
	GET_SIMPLEDATA(2204,"获取简单数据"),
	LUCKY_BOX (2205,"宝箱"),
	LOW(2206,"低保"),
	LUCKY_有玩家开宝箱 (2206,"有玩家开宝箱"),
	
	REWARD(2210,"领取奖励"),
	
	 /**************设置*****************/
	 
	/****************** 自定义，用于日志输出 ****************************/
	LOG_玩家增加金币(10001,""),
	LOG_微信支付回调(10009,""),
	LOG_支付宝回调(10010,""),
	LOG_支付回调验签成功(10011,""),
	LOG_添加玩家关联(10012,""),
	LOG_检测离线时间(10013,""),
	LOG_苹果支付回调验签成功(10014,""),
	LOG_获取GameData(10015,"获取GameData数据"),
	LOG_获取Player(10016,"获取Player数据"),
	
	 LOG_玩家回合增注(10017,"玩家回合增注"),

	/********************* 管理工具 *****************************/
	GM_服务器状态信息(10100,""),
	GM_发送公告(10101,""),
	GM_服务器关机(10102,""),
	GM_获取日志列表(10103,""),
	GM_GM工具登录(10104,""),
	GM_获取指定日志(10105,""),
	GM_重载配置(10106,""),
	GM_重启(10107,""),
	GM_设置机器人数量(10108,""),
	BACKEND_获取所有房间(10109,""),
	GM_发送邮件(10110,""),

	/********************* 负载测试 *****************************/
	LOADTEST_连接(10200,""),
	LOADTEST_测试1(10201,""),

	SERVER_PUSH_聊天服注册(10300,""),
	SERVER_PUSH_玩家聊天(10301,""),
	 
	/***********后台************/
	
	BACKEND_购买金币成功 (20001,"金币购买成功");
	
	private int msgType;
	private String text;
	private MsgTypeEnum(int msgType,String text)
	{
		this.msgType = msgType;
		this.text = text;
	}

	public int getType()
	{
		return msgType;
	}
	
	public String getText()
	{
		return text;
	}
}